#### Terraform Format and Style 🖌 failure
#### Terraform Initialization ⚙️ success
#### Terraform Validation 🤖 success
<details><summary>Validation Output</summary>

```

Warning: Argument is deprecated

  with module.cosmos_db.azurerm_cosmosdb_sql_container.main,
  on modules/cosmos-db/main.tf line 44, in resource "azurerm_cosmosdb_sql_container" "main":
  44:   partition_key_path  = "/threadId"

`partition_key_path` will be removed in favour of the property
`partition_key_paths` in version 4.0 of the AzureRM Provider.

Warning: Deprecated attribute

  on modules/cosmos-db/outputs.tf line 24, in output "connection_strings":
  24:   value       = azurerm_cosmosdb_account.main.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖 success

<details><summary>Show Plan</summary>

```terraform
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNmU1YjIwZC03MmRkLTRiMmQtODMzNi1kMTUxNTNmMDlhYjE7b2JqZWN0SWQ9YjUzMGFhZjUtYTFjNy00MTk0LWFmNmItYjQxZDA2YWMwYjExO3N1YnNjcmlwdGlvbklkPWNjOTZkOGQ0LTIzNjAtNGE5MS05NTI0LTkyNDg4MWM0MTU1MDt0ZW5hbnRJZD04ZWJlY2NiMy0xOWI5LTQ2NWQtYTY4NS1kYTA1YTZlZDNhZGU=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "projectpal-dev-rg"
      + tags     = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "projectpal"
        }
    }

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.container_apps.azurerm_container_app.backend will be created
  + resource "azurerm_container_app" "backend" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "projectpal-dev-backend"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "projectpal-dev-rg"
      + revision_mode                 = "Single"
      + tags                          = {
          + "CostCenter" = "Engineering"
          + "ManagedBy"  = "Terraform"
          + "Project"    = "ProjectPal"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 3001
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "registry-password"
          + server               = (known after apply)
          + username             = (sensitive value)
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 5
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/azuredocs/containerapps-helloworld:latest"
              + memory            = "1Gi"
              + name              = "backend"

              + env {
                  + name  = "NODE_ENV"
                  + value = "production"
                }
              + env {
                  + name  = "PORT"
                  + value = "3001"
                }
              + env {
                  + name        = "OPENAI_API_KEY"
                  + secret_name = "openai-api-key"
                }
              + env {
                  + name  = "OPENAI_MODEL"
                  + value = "gpt-4o-mini"
                }
              + env {
                  + name  = "MEMORY_STORAGE_TYPE"
                  + value = "cosmos"
                }
              + env {
                  + name  = "COSMOS_DB_ENDPOINT"
                  + value = (known after apply)
                }
              + env {
                  + name        = "COSMOS_DB_KEY"
                  + secret_name = "cosmos-key"
                }
              + env {
                  + name  = "COSMOS_DB_DATABASE"
                  + value = "projectpal"
                }
              + env {
                  + name  = "COSMOS_DB_CONTAINER"
                  + value = "conversations"
                }
              + env {
                  + name  = "STORAGE_ACCOUNT_NAME"
                  + value = (known after apply)
                }
              + env {
                  + name        = "STORAGE_ACCOUNT_KEY"
                  + secret_name = "storage-key"
                }
              + env {
                  + name  = "STORAGE_CONTAINER_NAME"
                  + value = "documents"
                }
              + env {
                  + name  = "FRONTEND_URL"
                  + value = (known after apply)
                }
              + env {
                  + name  = "ALLOWED_ORIGINS"
                  + value = (known after apply)
                }
              + env {
                  + name  = "APPLICATIONINSIGHTS_CONNECTION_STRING"
                  + value = (sensitive value)
                }
            }
        }
    }

  # module.container_apps.azurerm_container_app_environment.main will be created
  + resource "azurerm_container_app_environment" "main" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "eastus"
      + log_analytics_workspace_id       = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "projectpal-dev-env"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "projectpal-dev-rg"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "CostCenter" = "Engineering"
          + "ManagedBy"  = "Terraform"
          + "Project"    = "ProjectPal"
        }
      + zone_redundancy_enabled          = false
    }

  # module.container_registry.azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = (known after apply)
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "projectpal-dev-rg"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + tags                          = {
          + "CostCenter" = "Engineering"
          + "ManagedBy"  = "Terraform"
          + "Project"    = "ProjectPal"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # module.cosmos_db.azurerm_cosmosdb_account.main will be created
  + resource "azurerm_cosmosdb_account" "main" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + automatic_failover_enabled                   = (known after apply)
      + burst_capacity_enabled                       = false
      + connection_strings                           = (sensitive value)
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + enable_automatic_failover                    = (known after apply)
      + enable_free_tier                             = (known after apply)
      + enable_multiple_write_locations              = (known after apply)
      + endpoint                                     = (known after apply)
      + free_tier_enabled                            = (known after apply)
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = "eastus"
      + minimal_tls_version                          = (known after apply)
      + mongo_server_version                         = (known after apply)
      + multiple_write_locations_enabled             = (known after apply)
      + name                                         = (known after apply)
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = true
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "projectpal-dev-rg"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + tags                                         = {
          + "CostCenter" = "Engineering"
          + "ManagedBy"  = "Terraform"
          + "Project"    = "ProjectPal"
        }
      + write_endpoints                              = (known after apply)

      + capabilities {
          + name = "EnableServerless"
        }

      + consistency_policy {
          + consistency_level = "Session"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "eastus"
          + zone_redundant    = false
        }
    }

  # module.cosmos_db.azurerm_cosmosdb_sql_container.main will be created
  + resource "azurerm_cosmosdb_sql_container" "main" {
      + account_name        = (known after apply)
      + database_name       = "projectpal"
      + id                  = (known after apply)
      + name                = "conversations"
      + partition_key_kind  = "Hash"
      + partition_key_path  = "/threadId"
      + partition_key_paths = (known after apply)
      + resource_group_name = "projectpal-dev-rg"
      + throughput          = (known after apply)

      + indexing_policy {
          + indexing_mode = "consistent"

          + excluded_path {
              + path = "/\"_etag\"/?"
            }

          + included_path {
              + path = "/*"
            }
        }
    }

  # module.cosmos_db.azurerm_cosmosdb_sql_database.main will be created
  + resource "azurerm_cosmosdb_sql_database" "main" {
      + account_name        = (known after apply)
      + id                  = (known after apply)
      + name                = "projectpal"
      + resource_group_name = "projectpal-dev-rg"
      + throughput          = (known after apply)
    }

  # module.monitoring.azurerm_application_insights.main will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "projectpal-dev-insights"
      + resource_group_name                   = "projectpal-dev-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "CostCenter" = "Engineering"
          + "ManagedBy"  = "Terraform"
          + "Project"    = "ProjectPal"
        }
      + workspace_id                          = (known after apply)
    }

  # module.monitoring.azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "projectpal-dev-logs"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "projectpal-dev-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "CostCenter" = "Engineering"
          + "ManagedBy"  = "Terraform"
          + "Project"    = "ProjectPal"
        }
      + workspace_id                    = (known after apply)
    }

  # module.static_web_app.azurerm_static_web_app.main will be created
  + resource "azurerm_static_web_app" "main" {
      + api_key                            = (sensitive value)
      + app_settings                       = {
          + "PUBLIC_BACKEND_URL" = ""
        }
      + configuration_file_changes_enabled = true
      + default_host_name                  = (known after apply)
      + id                                 = (known after apply)
      + location                           = "eastus2"
      + name                               = "projectpal-dev-frontend"
      + preview_environments_enabled       = true
      + resource_group_name                = "projectpal-dev-rg"
      + sku_size                           = "Free"
      + sku_tier                           = "Free"
      + tags                               = {
          + "CostCenter" = "Engineering"
          + "ManagedBy"  = "Terraform"
          + "Project"    = "ProjectPal"
        }
    }

  # module.storage.azurerm_storage_account.main will be created
  + resource "azurerm_storage_account" "main" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "projectpal-dev-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CostCenter" = "Engineering"
          + "ManagedBy"  = "Terraform"
          + "Project"    = "ProjectPal"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + cors_rule {
              + allowed_headers    = [
                  + "*",
                ]
              + allowed_methods    = [
                  + "GET",
                  + "HEAD",
                  + "POST",
                  + "PUT",
                ]
              + allowed_origins    = [
                  + "*",
                ]
              + exposed_headers    = [
                  + "*",
                ]
              + max_age_in_seconds = 3600
            }
        }
    }

  # module.storage.azurerm_storage_container.main will be created
  + resource "azurerm_storage_container" "main" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "documents"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + application_insights_connection_string   = (sensitive value)
  + application_insights_instrumentation_key = (sensitive value)
  + backend_fqdn                             = (known after apply)
  + backend_name                             = "projectpal-dev-backend"
  + backend_url                              = (known after apply)
  + container_registry_admin_username        = (sensitive value)
  + container_registry_login_server          = (known after apply)
  + container_registry_name                  = (known after apply)
  + cosmos_container_name                    = "conversations"
  + cosmos_database_name                     = "projectpal"
  + cosmos_db_endpoint                       = (known after apply)
  + cosmos_db_name                           = (known after apply)
  + deployment_commands                      = {
      + acr_login       = (known after apply)
      + build_backend   = (known after apply)
      + frontend_deploy = "Use GitHub Actions with deployment token"
      + push_backend    = (known after apply)
    }
  + frontend_deployment_token                = (sensitive value)
  + frontend_url                             = (known after apply)
  + location                                 = "eastus"
  + log_analytics_workspace_id               = (known after apply)
  + next_steps                               = (known after apply)
  + resource_group_name                      = "projectpal-dev-rg"
  + storage_account_name                     = (known after apply)
  + storage_container_name                   = "documents"
  + storage_primary_blob_endpoint            = (known after apply)

Warning: Argument is deprecated

  with module.cosmos_db.azurerm_cosmosdb_sql_container.main,
  on modules/cosmos-db/main.tf line 44, in resource "azurerm_cosmosdb_sql_container" "main":
  44:   partition_key_path  = "/threadId"

`partition_key_path` will be removed in favour of the property
`partition_key_paths` in version 4.0 of the AzureRM Provider.

(and one more similar warning elsewhere)

Warning: Deprecated attribute

  on modules/cosmos-db/outputs.tf line 24, in output "connection_strings":
  24:   value       = azurerm_cosmosdb_account.main.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @CodeSaurabhCode, Action: pull_request, Workflow: Terraform Plan*